LEXICON = {
    "forward": ">>",
    "backward": "<<",
    "/start": "<b>🎉 Привет!</b>\n\n"
              "Это бот, в котором мы будем подводить итоги 2025 года, "
              "ностальгировать и получать поздравления ✨\n\n"
              "Напиши <b>/help</b> чтобы узнать правила игры!",

    "/help": "<b>🎮 Как играть?</b>\n\n"

             "1. <b>Старт игры</b>\n"
             "Кликай <b>/start</b> — зарегистрируйся в нашей уютной игре!\n\n"

             "2. <b>Пригласи партнёра</b>\n"
             "Нажми <b>/partner</b> и выбери человека, с которым хочешь делиться воспоминаниями.\n"
             "Это твой напарник на весь год! 👫\n\n"

             "3. <b>Создай воспоминание</b>\n"
             "Команда <b>/create_event</b> — здесь начинается магия!\n"
             "📸 <i>Сначала</i> пришли фото — любой момент из этого года\n"
             "❓ <i>Потом</i> придумай вопрос: \"Когда мы это сделали?\"\n"
             "📝 <i>Дальше</i> напиши 3 варианта дат — один правильный, два смешных\n\n"

             "4. <b>Отправь партнёру</b>\n"
             "Как только всё готово — викторина полетит твоему другу!\n"
             "У него будет 10 минут, чтобы угадать правильную дату ✨\n\n"

             "5. <b>Угадал? Поздравляй!</b>\n"
             "Если партнёр угадал — тебе придёт радостное уведомление 🎯\n"
             "Теперь твоя очередь написать тёплое поздравление командой <b>/congratulate</b>\n"
             "Можно добавить текст и даже фото — всё, что идёт от души! 💌\n\n"

             "6. <b>Сюрприз под Новый год</b>\n"
             "Все ваши послания мы сохраним и отправим вам обоим в самый тёплый момент новогодних каникул 🎄✨\n"
             "Как маленький подарок от вас — друг другу!\n\n"

             "<b>🎯 Коротко:</b>\n"
             "<code>/start</code> → <code>/partner</code> → <code>/create_event</code> (фото + викторина) → ждёшь ответа → <code>/congratulate</code> → ждёшь новогоднего сюрприза!",

    "/bookmarks": "<b>📌 Это список ваших закладок:</b>",
    "edit_bookmarks": "<b>✏️ Редактировать закладки</b>",
    "edit_bookmarks_button": "❌ РЕДАКТИРОВАТЬ",
    "del": "❌",
    "cancel": "ОТМЕНИТЬ",
    "no_bookmarks": "📭 У вас пока нет ни одной закладки.\n\n"
                    "Чтобы добавить страницу в закладки - во время чтения "
                    "книги нажмите на кнопку с номером этой страницы\n\n"
                    "<code>/continue</code> - продолжить чтение",
    "cancel_text": "<code>/continue</code> - продолжить чтение",
}

LEXICON_COMMANDS = {
    "/start": "🎉 Начать работу",
    "/create_event": "🎮 Создать воспоминание",
    "/partner": "👫 Выбрать партнёра",
    "/congratulate": "💌 Написать послание",
    "/help": "📖 Правила игры",
    "/my_congratulations": "📦 Мои послания",
}