LEXICON = {
    "forward": ">>",
    "backward": "<<",
    "/start": "<b>Привет!</b>\n\n""Это бот, в котором мы будем подводить итоги 2025 года"
              "ностальгировать и получать поздравления\n\n"
                "Набери команду /help что бы узнать правила игры",
    "/help": "<b>Правила игры</b>\n\nДля начала в меню выбери <b>Начать игру</b>\n\n/beginning - "
             "Эта команда начинает игру, после её нажатия ты должен отправить фото и потом создать викторину с 3-мя вариантами ответа и одним правильным о дат, в которую было сделано фото\n"
             "После того как ты это сделаешь игра отправиться твоему партнеру, он должен будет угадать дату\n"
             "Если он угадает тебе придет сообщение об этом и нужно будет написать поздравление\n"
             "Поздравления будут отправлены в чат вам обоим в случайный момент новогодних каникул",
    "/bookmarks": "<b>Это список ваших закладок:</b>",
    "edit_bookmarks": "<b>Редактировать закладки</b>",
    "edit_bookmarks_button": "❌ РЕДАКТИРОВАТЬ",
    "del": "❌",
    "cancel": "ОТМЕНИТЬ",
    "no_bookmarks": "У вас пока нет ни одной закладки.\n\nЧтобы "
                    "добавить страницу в закладки - во время чтения "
                    "книги нажмите на кнопку с номером этой "
                    "страницы\n\n/continue - продолжить чтение",
    "cancel_text": "/continue - продолжить чтение",
}


LEXICON_COMMANDS = {
    "/beginning": "Начать игру",
    "/partner": "Укажите партнера",
    "/my_congratulations": "Мои поздравления",
    "/help": "Правила игры",
}
